import React from "react";
import { datas, officer } from "./body";
import { Images } from "..";

const Body = () => {
  return (
    <div className="flex justify-between p-6">
      <div className="w-1/3">
        <p className="text-3xl font-semibold py-6">
          देवचुली नगरपालिकाको संक्षिप्त परिचय
        </p>
        <p className="text-lg">
          देवचुली नगरपालिका नेपालको राजधानी शहर काठमाण्डौँबाट करिव १५० कि.मी.को
          दुरीमा देशकै मध्य भागमा अवस्थित नवलपरासी जिल्लाको नवलपुर
          क्षेत्रमारहेकोछ । साविकका दिव्यपुरी, देवचुली र प्रगतिनगर
          गा.वि.स.लाईसमावेश गरी नेपाल सरकार मन्त्रीपरिषदको मिति २०७१ वैशाख २५ को
          निर्णयानुसार घोषित नगरपालिका मिति २०७३ फागुन २७ को नेपाल सरकारको
          निर्णयबाट साविक रजहर गा.वि.स. समावेश भई गठन भएको नगरपालिका हो ।
          नेपालको गण्डकी प्रदेशमा पर्ने यो नगरपालिकाको कुल क्षेत्रफल ११२.७२ वर्ग
          कि.मी रहेको छ । यसको पूर्वमा गैंडाकोट नगरपालिका, पश्चिममा हुप्सेकोट
          गाँउपालिका र कावासोती नगरपालिका, उत्तरमा बुलिङटार गाँउपालिका र
          दक्षिणमा चितवन राष्ट्रिय निकुञ्ज पर्दछन् । पूर्वी सिमानाको रुपमा
          महेन्द्र राजमार्गमा रहेको झरही खोला पश्चिमी सिमानामा सोही राजमार्गको
          लोकाहा खोला, उत्तरमा १९३८ मिटर उचाईको देवचुली डाँडा र दक्षिणमा पवित्र
          नारायणी नदीको चार सिमाना भित्र पर्ने यो नगरपालिकाको दलदले बजार
          नवलपरासी जिल्लाको पहाडी क्षेत्रको मुख्य प्रवेशद्वार हो । क्षेत्री,
          ब्राह्मण, मगर, तामाङ, नेवार आदि जाजजातिको बसोबास रहेको छ । २०७८ काे
          जनगणना अनुसार यस नगरपालिकामा हाल १४४९३ घरधुरी र ५८००३ जनसंख्या रहेको छ
          । जसमध्ये ३०६६७ महिला र २७३३६ पुरुष रहेका छन् भने बालबालिकाको संख्या
          १५३८९ रहेकाे छ । यस नगरपालिकाको साविकको प्रगतिनगर गा.वि.स.मा नेपालमै
          पहिलो बालक्लव “जागृति बालक्लव नेपाल” दर्ता भएको होे । हाल गण्डकी
          प्रदेशकाे प्रथम र नेपालकाे दाेस्राे बालमैत्री नगरपालिका घाेषणा भएकाे छ
          । भाद्र २९, २०७५ सालमा बालमैत्री घाेषणा समाराेहका प्रमुख अतिथि माननीय
          परराष्ट्र मन्त्री प्रदीपकुमार ज्ञवालीज्यूकाे अातिथ्तिमा सम्पन्न भएकाे
          थियाे । सामुदाय र विद्यालय स्तरमा करिव ९५ वटा बालक्लवहरु रहेका छन् ।
          यस नगरपालिकामा पर्ने साविकको प्रगतिनगर गा.वि.स. मिति २०६४ वैशाख २८ गते
          घोषित नेपालकै पहिलो खुला दिसामुक्त गा.वि.स. हो भने मिति २०७० पुष ९ गते
          नै पहिलो बालमैत्री गा.वि.स. घोषणा भएको हो । पूर्ण साक्षर, पूर्ण खोप
          घोषित यस नगरपालिकाका २६ वटा टोलहरु वातावरणमैत्री टोल घोषणा भईसकेको छन्
          । ऐतिहासिक, धार्मिक एवम् पर्यटकीय महत्व बोकेकोे देवचुली डाँडा,
          होमस्टेको प्रचुर सम्भावना बोकेको र मगर समुदायको बसोबास रहेको कुमसोत,
          किर्तिपुर र बन्दीपुर जस्ता बस्तीहरु लगायत संचालनमा आएको पिप्रहर
          होमस्टे र नारायणी नदी किनारमा रहेको होटल, रिसोर्ट तथा मध्यवर्ती
          सामुदायिक वनहरुले यस नगरपालिकाको पर्यटकीय विकासमा सम्भावनालाई समेटेको
          छन् । यहाँका समथर खेतीयोेग्य जमिन तथा तरकारी उत्पादनका पकेट
          क्षेत्रहरुले कृषि तथा अर्गानिक खेतीको सम्भावना रहेकोे नगरपालिकाको
          पहाडी बस्तीहरुमा पशुपालन एवम् मौरी पालनको उत्तिकै बढी सम्भावना छ ।
          नेपालकै ठुलो औद्योेगिक धराना मध्येको एक चौधरी ग्रुपको सि.जी.
          इन्डष्ट्रिज पार्क लगायत, ईट्टा उद्योग, क्रसर उद्योेग र अन्य स्थापना
          हुँदै गरेका उद्योगहरुले औद्योगिक संस्कार एवम् रोजगारीका सम्भावनाहरु
          उजागर हुँदै छन् । देवचुली सेन्टरप्लट, धारापानी, पृथ्वीनगर, जनज्योेति,
          दिव्यपुरी, रजहर, फारम लगायतका खेलमैदान र घुमाउरी पिक्नीक स्पर्ट एण्ड
          पार्क, नागपोखरी बालउद्यान, सकला बालउद्यान लगायतका सालघारी, कदमपुर,
          शान्तीगैरा सिमसार पोखरीहरुले खेलकुद र मनोरञ्जनका थुप्रै सम्भावना
          बोकेका छन् । शाश्वतधाम, कालिका मन्दिर, पशुपति मन्दिर, बराजु थान,
          तीनकन्या माई , एकादशी मेला लाग्ने नारायणी तटकै मैदान लगायतका धार्मिक
          स्थलहरु धार्मिक पर्यटनका लागि महत्वपूर्ण छन् ।
        </p>
      </div>
      <div className="w-1/3 border-l-2 mx-5 px-4">
        <p className="text-3xl text-blue-900 font-semibold py-6">
          सूचना तथा समाचार
        </p>
        <div className=" space-y-5">
          {datas.map((item, id) => {
            return (
              <div key={id}>
                <p className="text-[22px] text-black cursor-pointer font-medium">
                  {item.text}
                </p>
                <hr />
              </div>
            );
          })}
        </div>
        <button className="bg-blue-800 text-[#fff] p-3 mt-3">थप समाचार</button>
      </div>
      <div className="w-1/3">
        <p className="text-3xl text-blue-900 font-semibold py-6">
          जन प्रतिनिधि
        </p>
        <div>
          {officer.map((item, id) => {
            return (
              <div key={id}>
                {`{Images.${item.image}}`}
                {/* {`Images.${item.image}`} */}
                <img
                  // src={Images.man}
                  src={`{Images}.${item.image}}`}
                  alt=""
                  className="h-36 w-36 object-cover"
                />

                <p>{item.name}</p>
                <p>{item.phone}</p>
              </div>
            );
          })}
        </div>
      </div>
    </div>
  );
};

export default Body;
