export const datas = [
  {
    text: " चालू आर्थिक व २०७९८० को भुक्तानी र खाता बन्द हुने सम्बन्धी सूचना",
  },
  {
    text: " चालू आर्थिक व २०७९८० को भुक्तानी र खाता बन्द हुने सम्बन्धी सूचना",
  },
  {
    text: " चालू आर्थिक व २०७९८० को भुक्तानी र खाता बन्द हुने सम्बन्धी सूचना",
  },
  {
    text: " चालू आर्थिक व २०७९८० को भुक्तानी र खाता बन्द हुने सम्बन्धी सूचना",
  },
];

export const officer = [
  {
    image: "man",
    name: "हरि प्रसाद न्याैपाने",
    phone: "९८५७०४१८७७",
    post: "नगर प्रमुख",
  },
  {
    image: "man",
    name: "पार्वता तिवारी",
    phone: "९८५७०४०७४२",
    post: "नगर उप प्रमुख",
  },
  {
    image: "man",
    name: "तिल प्रसाद काफ्ले",
    phone: "9857019222",
    post: "नगर प्रवक्ता एवम् १ १ न. वडा अध्यक्ष",
  },
];
